app/controllers/photos_controller.rb

    def index
        @photos = Photo.all
---
SELECT "photos".* FROM "photos"

    def create
        @photo = Photo.new(photo_params)
    if @photo.save
---
INSERT INTO "photos" ("image", "title", "memo", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

    def update
      if @photo.update_attributes(photo_params)
---
UPDATE "photos" SET "memo" = ?, "updated_at" = ? WHERE "photos"."id" = ?  [["memo", "悔しいなあ。一つ何かできるようになっても、まだまだ次の壁は次々出てくる。"], ["updated_at", "2020-03-10 06:50:59.260117"], ["id", 9]]

    def destroy
      @photo.destroy
---
DELETE FROM "photos" WHERE "photos"."id" = ?  [["id", 2]]

      def set_list
        @photo = Photo.find_by(id: params[:id])
---
SELECT "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]